In [1]:
import pandas as pd

In [7]:
index = ['a','b','c']
columns = ['Sales1','Sales2','Sales3']
row = [[123,768,756],[586,475,234],[674,432,876]]

In [8]:
df = pd.DataFrame(row,index, columns)

In [9]:
df

   Sales1  Sales2  Sales3
a     123     768     756
b     586     475     234
c     674     432     876

In [10]:
df['Sales2']

a    768
b    475
c    432
Name: Sales2, dtype: int64

In [12]:
df.describe()

           Sales1      Sales2      Sales3
count    3.000000    3.000000    3.000000
mean   461.000000  558.333333  622.000000
std    296.005068  182.845107  341.332682
min    123.000000  432.000000  234.000000
25%    354.500000  453.500000  495.000000
50%    586.000000  475.000000  756.000000
75%    630.000000  621.500000  816.000000
max    674.000000  768.000000  876.000000

In [13]:
df.loc['b']

Sales1    586
Sales2    475
Sales3    234
Name: b, dtype: int64

In [14]:
df.loc['c']['Sales2']

432

In [15]:
df

   Sales1  Sales2  Sales3
a     123     768     756
b     586     475     234
c     674     432     876

In [17]:
df['Total'] = df['Sales1'] + df['Sales2'] + df['Sales3']

In [18]:
df

   Sales1  Sales2  Sales3  Total
a     123     768     756   1647
b     586     475     234   1295
c     674     432     876   1982

In [22]:
[[123+768+756],
[586+475+234],
[674+432+876]]

[[1647], [1295], [1982]]

In [23]:
df[['Sales1','Sales3']]

   Sales1  Sales3
a     123     756
b     586     234
c     674     876

In [24]:
df.loc['c'][['Sales1','Sales3']]

Sales1    674
Sales3    876
Name: c, dtype: int64

In [25]:
df.loc['c'][['Sales1','Sales2','Sales3']]

Sales1    674
Sales2    432
Sales3    876
Name: c, dtype: int64

In [26]:
df

   Sales1  Sales2  Sales3  Total
a     123     768     756   1647
b     586     475     234   1295
c     674     432     876   1982

In [27]:
df.drop('Sales2', axis=1)

   Sales1  Sales3  Total
a     123     756   1647
b     586     234   1295
c     674     876   1982

In [28]:
df

   Sales1  Sales2  Sales3  Total
a     123     768     756   1647
b     586     475     234   1295
c     674     432     876   1982

In [29]:
df.drop('Sales2', axis=1, inplace=True)

In [30]:
df

   Sales1  Sales3  Total
a     123     756   1647
b     586     234   1295
c     674     876   1982

In [32]:
df['Total'] = df['Sales1'] + df['Sales3']

In [33]:
df

   Sales1  Sales3  Total
a     123     756    879
b     586     234    820
c     674     876   1550